Autodesk.Revit.DB.VirtualPrinterType
An enumerated to list Virtual Printer Types in Revit.

Autodesk.Revit.DB.VirtualPrinterType.XPSWriter
Microsoft XPS Document Writer.

Autodesk.Revit.DB.VirtualPrinterType.DWFWriter
DWFWriter.

Autodesk.Revit.DB.VirtualPrinterType.AdobePDF
AdobePDF.

Autodesk.Revit.DB.VirtualPrinterType.None
None.